

 
"
-
.
/
0
1
2
3
4
5
6
7
8
9
:
<
=
>
?
C
E
H
M
O
R
T
U
X
[
]
_
a
b
c
e
f
h
i
k
m
o
p
r
t
u
w
x
{
}
·
И
Й
с
щ
ы
—
‘
’
“
”
…
─
■
□
　
、
。
《
》
【
】
〔
〕
〖
〗
ぃ
い
ぅ
う
ぇ
だ
も
や
コ
バ
一
丁
七
万
丈
三
上
下
不
与
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
丞
丢
两
严
丧
个
丫
中
丰
串
临
丸
丹
为
主
丽
举
乂
乃
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
乜
九
乞
也
习
乡
书
乩
买
乱
乳
乾
了
予
争
事
二
于
亏
云
互
五
井
亘
亚
些
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亲
亵
亹
人
亻
亿
什
仁
仃
仄
仅
仆
仇
今
介
仍
从
仑
仓
仔
仕
他
仗
付
仙
仞
代
令
以
仪
们
仰
仲
仵
件
价
任
份
仿
伉
伊
伍
伎
伏
伐
休
众
优
伙
会
伛
伞
伟
传
伤
伦
伪
伫
伯
估
伴
伶
伷
伸
伺
似
伽
佃
但
佇
位
低
住
佐
佑
体
何
佗
余
佚
佛
作
佞
你
佣
佥
佩
佯
佳
佻
使
侃
侄
侈
例
侍
侑
供
依
侠
侣
侥
侦
侧
侪
侬
侮
侯
侵
便
促
俄
俊
俎
俏
俐
俑
俗
俘
俚
俛
俜
保
俞
俟
信
俦
俨
俩
俪
俫
俭
修
俯
俱
俵
俸
俺
俾
倅
倈
倍
倏
倐
倒
倔
倕
倘
候
倚
倜
借
倡
倥
倦
倨
倩
倪
倭
债
值
倾
偃
假
偈
偌
偎
偏
偕
做
停
健
偬
偶
偷
偻
偿
傀
傅
傍
傕
傞
傥
傧
储
傩
催
傲
傻
像
僚
僝
僧
僭
僮
僵
僻
僽
儁
儋
儒
儡
儾
儿
兀
允
元
兄
充
兆
先
光
克
免
兑
兔
兕
兖
党
兜
兢
入
全
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
冀
内
冈
冉
册
再
冒
冓
冕
冗
写
军
农
冠
冢
冤
冥
冬
冯
冰
冲
决
况
冶
冷
冻
冽
净
凄
准
凉
凋
凌
减
凑
凛
凝
几
凡
凤
凫
凭
凯
凰
凳
凶
凸
凹
出
击
函
凿
刀
刁
刂
刃
分
切
刈
刎
刑
划
刖
列
刘
则
刚
创
初
删
判
刨
利
别
刬
刮
到
刳
制
刷
券
刹
刺
刻
刽
剁
剂
剃
削
剌
前
剐
剑
剔
剖
剜
剡
剥
剧
剩
剪
副
割
剽
剿
劈
劖
力
劝
办
功
加
务
劣
动
助
努
劫
劬
劭
励
劲
劳
劾
势
勃
勅
勇
勉
勋
勑
勒
勖
勘
募
勣
勤
勺
勾
勿
匀
匄
包
匆
匈
匍
匏
匐
化
北
匙
匝
匠
匡
匣
匪
匮
匹
区
医
匼
匾
匿
十
千
升
午
卉
半
卍
华
协
卑
卒
卓
单
卖
南
博
卜
卞
占
卢
卣
卤
卦
卧
卫
卮
卯
印
危
即
却
卵
卷
卸
卺
卿
厂
厄
厅
历
厉
压
厌
厔
厕
厘
厚
厝
原
厢
厥
厦
厨
厮
去
县
参
叆
叇
又
叉
及
友
双
反
发
叔
取
受
变
叙
叛
叟
叠
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叽
吁
吃
各
吅
吆
合
吉
吊
同
名
后
吏
吐
向
吒
吓
吕
吗
君
吝
吞
吟
吠
吣
否
吧
吩
含
听
吮
启
吱
吴
吵
吸
吹
吻
吼
吽
吾
呀
呆
呈
告
呐
呕
呖
员
呙
呛
呜
呢
呦
周
呱
呲
味
呵
呶
呷
呸
呻
呼
命
咀
咂
咄
咆
咇
咈
咋
和
咎
咏
咐
咒
咕
咙
咚
咛
咤
咥
咦
咧
咨
咪
咫
咬
咭
咯
咱
咳
咶
咸
咻
咽
咿
哀
品
哂
哃
哄
哆
哇
哈
哉
响
哎
哏
哑
哕
哗
哙
哜
哝
哟
哥
哦
哧
哨
哩
哪
哭
哮
哲
哳
哺
哼
哽
唆
唇
唉
唎
唏
唐
唝
唠
唣
唤
唧
唪
唬
唯
唰
唱
唳
唵
唼
唾
唿
啃
啄
啅
商
啈
啊
啐
啕
啖
啜
啬
啭
啮
啯
啰
啷
啸
啻
啼
啾
喀
喁
喂
喃
善
喇
喈
喉
喊
喋
喏
喑
喔
喘
喙
喜
喝
喟
喧
喨
喳
喷
喻
喽
嗄
嗅
嗉
嗐
嗒
嗓
嗔
嗗
嗛
嗜
嗟
嗡
嗣
嗤
嗳
嗷
嗽
嘁
嘈
嘉
嘎
嘏
嘑
嘘
嘛
嘟
嘡
嘤
嘬
嘱
嘲
嘴
嘶
嘹
嘻
噀
噇
噎
噔
噗
噘
噙
噜
噤
器
噪
噫
噬
噹
嚈
嚎
嚏
嚓
嚣
嚷
嚼
囊
囒
囔
囚
四
回
囟
因
团
囧
囫
园
困
囱
围
囵
囷
囹
固
国
图
圃
圄
圆
圈
圉
圊
圜
圞
土
圣
在
圩
圭
圯
地
圹
场
址
坂
均
坊
坌
坍
坎
坏
坐
坑
块
坚
坛
坞
坟
坠
坡
坤
坦
坫
坯
坳
坷
坼
垂
垄
垒
垓
垕
垛
垠
垢
垣
垤
垦
垫
埂
埃
埋
城
埘
域
埠
埭
培
基
堂
堆
堑
堕
堡
堤
堪
堰
堵
塌
塍
塑
塔
塘
塞
填
塵
塾
墀
境
墅
墉
墓
墙
增
墟
墨
墩
墵
壁
壅
壎
壑
壕
壤
士
壬
壮
声
壳
壶
壸
处
备
复
夏
夔
夕
外
夙
多
夜
够
夤
夥
大
天
太
夫
夬
夭
央
夯
失
头
夷
夸
夹
夺
奁
奂
奄
奇
奈
奉
奋
奎
奏
契
奔
奕
奖
套
奘
奚
奠
奢
奥
女
奴
奶
奸
好
妁
如
妃
妄
妆
妇
妈
妍
妒
妓
妖
妙
妞
妤
妥
妨
妩
妪
妫
妯
妲
妹
妻
妾
姆
姊
始
姌
姐
姑
姓
委
姚
姜
姝
姢
姣
姥
姨
姬
姮
姹
姻
姽
姿
威
娃
娄
娆
娇
娈
娉
娌
娑
娘
娜
娟
娣
娥
娩
娱
娲
娴
娶
娼
婀
婆
婉
婕
婚
婢
婪
婳
婴
婵
婶
婷
婺
婿
媒
媖
媚
媛
媪
媳
媸
媾
嫁
嫂
嫉
嫋
嫌
嫔
嫖
嫠
嫡
嫣
嫦
嫩
嫱
嬉
嬖
嬗
嬝
嬴
嬷
孀
子
孑
孔
孕
字
存
孙
孚
孛
孜
孝
孟
季
孤
孥
学
孩
孰
孱
孳
孺
孽
宁
宄
宅
宇
守
安
宋
完
宏
宓
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宥
宦
宪
宫
宰
害
宴
宵
家
宸
容
宽
宾
宿
寂
寄
寅
密
寇
富
寐
寒
寓
寔
寝
寞
察
寡
寤
寥
寨
寮
寰
寸
对
寺
寻
导
寿
封
射
将
尉
尊
小
少
尔
尖
尘
尚
尝
尞
尤
尧
尪
尬
就
尴
尸
尹
尺
尻
尼
尽
尾
尿
局
屁
层
屃
屄
居
屈
屉
届
屋
屎
屏
屐
屑
展
属
屟
屠
屡
屣
履
屦
屯
山
屹
岁
岂
岌
岐
岑
岔
岖
岗
岘
岚
岛
岩
岫
岭
岱
岳
岷
岸
峙
峡
峤
峥
峦
峨
峪
峭
峰
峻
崇
崎
崒
崔
崖
崚
崤
崦
崩
崽
嵂
嵇
嵋
嵌
嵎
嵘
嵩
嵬
嵯
嵸
嶂
嶒
嶝
嶲
嶷
巅
巉
巍
川
州
巡
巢
工
左
巧
巨
巩
巫
差
己
已
巳
巴
巷
巽
巾
币
市
布
帅
帆
师
希
帏
帐
帑
帓
帔
帕
帖
帘
帙
帚
帛
帜
帝
带
席
帮
帷
常
帻
帼
帽
幄
幅
幌
幔
幕
幙
幛
幡
幢
干
平
年
并
幸
幺
幻
幼
幽
广
庄
庆
庇
床
序
庐
庑
库
应
底
庖
店
庙
庚
府
庞
废
度
座
庭
庵
庶
康
庸
庾
廉
廊
廒
廓
廖
廙
廛
廨
廪
延
廷
建
开
弁
异
弃
弄
弇
弈
弊
弋
式
弑
弓
引
弗
弘
弛
弟
张
弥
弦
弧
弩
弭
弯
弱
弹
强
弼
彀
归
当
录
彗
彘
彝
形
彤
彦
彧
彩
彪
彬
彭
彰
影
彷
役
彻
彼
往
征
徂
径
待
徇
很
徉
徊
律
徐
徒
得
徘
徙
徜
御
徨
循
徭
微
徵
德
徼
徽
心
忄
必
忆
忌
忍
忏
忐
忑
忒
忖
志
忘
忙
忝
忠
忡
忤
忧
快
忱
忳
念
忻
忽
忿
怀
态
怂
怄
怅
怆
怎
怏
怒
怔
怕
怖
怛
怜
思
怠
怡
急
性
怨
怪
怬
怯
总
怿
恁
恂
恃
恋
恍
恐
恒
恓
恕
恙
恢
恣
恤
恧
恨
恩
恪
恬
恭
息
恰
恳
恶
恸
恹
恺
恻
恼
恽
恿
悃
悄
悉
悌
悍
悒
悔
悖
悚
悟
悠
患
悦
您
悫
悬
悭
悮
悯
悲
悴
悸
悼
情
惆
惇
惊
惋
惑
惓
惕
惘
惙
惚
惛
惜
惟
惠
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
想
惴
惶
惹
惺
愀
愁
愆
愈
愉
愍
意
愕
愚
感
愠
愤
愦
愧
愬
愿
慄
慈
慌
慎
慑
慓
慕
慢
慧
慨
慰
慵
慷
慽
憋
憎
憔
憨
憩
憾
懂
懈
懊
懋
懑
懒
懔
懞
懦
懵
懿
戆
戈
戊
戌
戍
戎
戏
成
我
戒
戕
或
戗
战
戚
戛
戟
戢
戥
截
戮
戳
戴
户
戾
房
所
扁
扃
扆
扇
扈
扉
手
扌
才
扎
扑
扒
打
扔
托
扛
扞
扠
扢
扣
执
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扼
找
承
技
抄
抅
抉
把
抑
抒
抓
抔
投
抖
抗
折
抚
抛
抟
抠
抡
抢
护
报
披
抬
抱
抵
抹
押
抽
抿
拂
拃
拄
担
拆
拇
拈
拉
拊
拌
拍
拐
拑
拒
拓
拔
拖
拗
拘
拙
拚
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拱
拳
拴
拶
拷
拼
拽
拾
拿
持
挂
指
挈
按
挎
挑
挖
挛
挜
挝
挞
挟
挠
挡
挣
挤
挥
挦
挨
挪
挫
振
挲
挹
挺
挽
捆
捉
捋
捍
捎
捏
捐
捕
捘
捞
损
捡
换
捣
捧
据
捱
捶
捷
捺
捻
捽
掀
掂
掇
授
掉
掊
掌
掎
掏
掐
排
掖
掘
掠
探
掣
掤
接
控
推
掩
措
掬
掭
掮
掯
掰
掳
掷
掸
掺
掼
掾
揆
揉
揌
揎
描
提
插
揖
揝
揞
握
揣
揩
揪
揫
揭
揲
援
揸
揽
揾
搀
搁
搂
搅
搊
搏
搐
搓
搔
搕
搛
搜
搠
搦
搧
搪
搫
搬
搭
搲
搳
搴
携
搽
摁
摄
摆
摇
摊
摔
摘
摧
摩
摭
摸
摹
摺
撂
撄
撅
撇
撑
撒
撕
撚
撞
撢
撤
撩
撬
播
撮
撰
撵
撷
撺
撼
擂
擅
擉
操
擎
擐
擒
擘
擞
擢
擦
擿
攀
攒
攘
攥
攦
攮
支
收
攸
改
攻
放
政
敁
故
效
敌
敏
救
敔
敕
敖
教
敛
敝
敞
敠
敢
散
敦
敧
敬
数
敲
整
敷
文
斋
斌
斐
斑
斓
斗
料
斛
斜
斝
斟
斡
斤
斥
斧
斩
斫
断
斯
新
方
於
施
旁
旂
旃
旄
旅
旆
旋
旌
族
旒
旗
旙
无
既
日
旦
旧
旨
早
旬
旭
旰
旱
时
旷
旺
旻
昂
昃
昆
昊
昌
明
昏
易
昔
昕
昙
星
映
春
昧
昨
昭
是
昱
昴
昵
昶
昼
显
晃
晋
晌
晏
晒
晓
晔
晕
晖
晙
晚
晡
晤
晦
晨
普
景
晰
晴
晶
智
晾
暂
暄
暇
暑
暖
暗
暝
暧
暨
暮
暴
暹
曀
曙
曛
曜
曦
曩
曰
曲
曳
更
曷
曹
曼
曾
替
最
月
有
朋
服
朐
朔
朕
朗
望
朝
期
朦
木
未
末
本
札
术
朱
朴
朵
机
朽
杀
杂
权
杆
杈
杉
杌
李
杏
材
村
杓
杖
杜
杞
束
杠
条
来
杨
杩
杪
杭
杯
杰
杲
杳
杵
杷
杻
松
板
极
构
枇
枉
枋
析
枒
枓
枕
林
枚
果
枝
枢
枣
枥
枪
枫
枭
枯
枰
枳
架
枷
枸
枹
柄
柏
某
柑
染
柔
柘
柚
柜
柞
柢
查
柩
柬
柮
柯
柰
柱
柳
柴
柿
栀
栅
标
栈
栉
栊
栋
栎
栏
树
栓
栖
栗
校
栩
株
样
核
根
格
栽
桀
桂
桃
桅
框
案
桌
桎
桐
桑
桓
桔
桠
桡
档
桥
桧
桨
桩
桶
梁
梃
梅
梆
梏
梓
梗
梢
梦
梧
梨
梭
梯
械
梳
梵
检
棂
棉
棋
棍
棒
棔
棕
棘
棚
棠
棣
棨
棬
森
棱
棵
棹
棺
椁
椅
植
椒
椟
椰
椽
椿
楙
楚
楝
楞
楟
楠
楣
楫
楮
楯
楷
楸
楹
楼
概
榄
榆
榇
榔
榛
榜
榧
榭
榴
榻
榾
槁
槃
槅
槊
槌
槎
槐
槔
槛
槟
槥
槺
槽
槿
樊
樗
模
樨
横
樯
樱
樵
樽
樾
橄
橇
橐
橘
橙
橦
橱
橹
橼
檀
檄
檎
檐
檠
檫
欠
次
欢
欣
欤
欧
欲
欷
欹
欺
款
歃
歆
歇
歉
歌
歔
止
正
此
步
武
歧
歪
歹
死
歼
殁
殂
殃
殄
殆
殉
殊
残
殒
殓
殖
殚
殛
殡
殪
殴
段
殷
殿
毁
毂
毅
毋
母
每
毒
毓
比
毕
毖
毗
毙
毛
毡
毧
毫
毬
毯
氅
氆
氇
氏
氐
民
气
氛
氤
氲
水
氵
永
汀
汁
求
汇
汉
汊
汎
汕
汗
汙
汛
汜
汝
汞
江
池
污
汤
汨
汪
汰
汲
汶
汹
汽
汾
沁
沂
沃
沅
沆
沈
沉
沌
沍
沏
沐
沓
沔
沙
沛
沟
没
沤
沥
沦
沧
沪
沫
沮
沱
河
沸
油
治
沼
沽
沾
沿
泄
泉
泊
泌
泓
法
泗
泛
泞
泠
泡
波
泣
泥
注
泪
泫
泯
泰
泱
泸
泻
泼
泽
泾
洁
洄
洇
洋
洎
洑
洒
洗
洛
洞
津
洪
洮
洱
洲
洹
活
洼
洽
派
流
浅
浆
浇
浊
测
浍
济
浏
浑
浓
浔
浙
浚
浣
浥
浦
浩
浪
浮
浴
海
浸
浼
涂
涅
消
涉
涌
涎
涓
涕
涛
涝
涟
涣
涤
润
涧
涨
涩
涪
涯
液
涴
涵
涸
涿
淄
淅
淆
淇
淋
淌
淑
淖
淘
淙
淝
淡
淤
淫
淬
淮
淯
深
淳
混
淹
添
清
渊
渌
渍
渎
渐
渑
渔
渗
渚
渝
渠
渡
渣
渤
渥
温
渭
港
渰
渴
游
渺
湃
湄
湅
湍
湓
湖
湘
湛
湫
湮
湲
湾
湿
溃
溅
溆
溉
源
溘
溜
溟
溢
溪
溯
溲
溶
溺
溽
滁
滂
滃
滇
滉
滋
滏
滑
滓
滔
滕
滚
滞
滟
满
滥
滨
滩
滴
漂
漆
漉
漏
漓
演
漕
漠
漩
漫
漯
漱
漳
漷
漾
潇
潘
潜
潠
潢
潦
潭
潮
潸
潺
潼
澄
澈
澌
澜
澡
澳
澹
激
濛
濡
濦
濬
濮
濯
瀑
瀚
瀛
瀣
瀼
灌
灒
灞
火
灭
灯
灰
灵
灶
灸
灼
灾
灿
炁
炉
炊
炎
炒
炕
炖
炙
炜
炫
炬
炭
炮
炯
炳
炷
炸
点
炼
炽
烁
烂
烈
烘
烙
烛
烝
烟
烤
烦
烧
烨
烫
烬
热
烹
烽
焃
焉
焕
焙
焚
焜
焦
焫
焯
焰
然
煅
煌
煎
煞
煠
煤
照
煨
煮
煼
煽
熄
熊
熌
熏
熔
熙
熝
熟
熨
熬
熯
熳
燃
燎
燐
燔
燕
燥
燧
燹
爆
爇
爊
爖
爨
爪
爬
爰
爱
爵
父
爷
爹
爻
爽
牁
牂
片
版
牌
牍
牒
牖
牙
牛
牝
牟
牡
牢
牧
物
牯
牲
牵
牸
特
牺
犀
犁
犄
犊
犍
犒
犟
犬
犭
犯
犴
状
犹
犺
犼
狂
狄
狈
狍
狎
狐
狔
狗
狙
狝
狞
狠
狡
狢
狤
狥
狨
狩
独
狭
狮
狰
狱
狲
狸
狺
狻
狼
猁
猇
猊
猍
猎
猕
猖
猗
猛
猜
猝
猞
猢
猥
猩
猪
猫
猬
献
猱
猴
猷
猾
猿
獐
獒
獗
獝
獠
獬
獭
獾
玄
率
玈
玉
王
玎
玑
玛
玠
玦
玨
玩
玫
环
现
玲
玳
玷
玺
玻
珀
珂
珉
珊
珍
珐
珑
珖
珝
珞
珠
珩
珪
班
珮
珰
球
琅
理
琉
琊
琏
琐
琗
琚
琛
琢
琥
琦
琪
琬
琮
琰
琳
琴
琵
琶
琼
瑀
瑁
瑒
瑕
瑙
瑚
瑛
瑜
瑞
瑟
瑠
瑯
瑰
瑶
瑾
璃
璆
璇
璋
璎
璘
璜
璝
璞
璧
璩
璿
瓒
瓘
瓜
瓟
瓠
瓢
瓣
瓤
瓦
瓮
瓯
瓴
瓶
瓷
甄
甍
甑
甘
甚
甜
生
甥
用
甩
甫
甬
田
由
甲
申
电
男
甸
画
畀
畅
畋
界
畏
畔
留
畜
略
畦
番
畯
畴
畸
畾
畿
疆
疏
疑
疔
疗
疙
疚
疠
疢
疤
疥
疫
疮
疯
疲
疴
疵
疸
疹
疼
疽
疾
病
症
痈
痊
痌
痒
痕
痖
痘
痛
痞
痢
痨
痫
痰
痴
瘁
瘌
瘖
瘟
瘠
瘢
瘤
瘦
瘩
瘫
瘰
瘴
瘸
瘼
癀
癃
癍
癖
癞
癣
癫
癸
登
白
百
皂
的
皆
皇
皈
皋
皎
皐
皑
皓
皖
皘
皤
皮
皱
皴
皻
皿
盂
盅
盆
盈
益
盍
盏
盐
监
盒
盔
盖
盗
盘
盛
盞
盟
盥
盩
目
盱
盲
直
盵
相
盹
盼
盾
省
眇
眉
眊
看
眙
真
眠
眦
眩
眭
眷
眸
眺
眼
着
睁
睃
睆
睇
睍
睖
睚
睛
睡
睢
督
睦
睨
睬
睮
睳
睹
睺
睿
瞅
瞋
瞌
瞎
瞑
瞒
瞔
瞟
瞥
瞧
瞪
瞬
瞰
瞳
瞻
瞽
瞿
矍
矗
矛
矜
矢
矣
知
矧
矩
矫
矬
短
矮
石
矴
矶
矼
矾
矿
砀
砂
砌
砍
砑
砒
研
砖
砚
砣
砥
砧
砭
砰
破
砸
砺
砾
硌
硕
硗
硝
硫
硬
确
碌
碍
碎
碑
碓
碗
碛
碜
碟
碣
碧
碰
碱
碴
確
碾
磁
磊
磋
磐
磔
磕
磨
磬
磲
磴
磷
磾
示
礼
社
祀
祁
祇
祈
祎
祐
祖
祗
祚
祛
祜
祝
神
祟
祠
祢
祥
祧
票
祭
祯
祲
祷
祸
祺
禀
禁
禄
禅
福
禧
禳
禹
禺
离
禽
禾
秀
私
秃
秇
秉
秋
种
科
秘
租
秣
秤
秦
秧
秩
秬
秭
积
称
移
秽
秾
稀
稂
程
稍
税
稔
稗
稚
稠
稳
稷
稹
稻
稼
稽
稿
穆
穑
穗
穰
穴
究
穷
穸
穹
空
穿
窀
突
窃
窄
窈
窊
窍
窎
窑
窕
窖
窗
窘
窜
窝
窟
窠
窣
窥
窦
窭
窸
窿
立
竖
站
竞
竟
章
竣
童
竦
竭
端
竹
竺
竽
竿
笃
笄
笆
笊
笋
笏
笑
笔
笙
笛
笞
笠
笤
符
笨
第
笮
笳
笺
笼
筅
筇
等
筋
筏
筐
筑
筒
答
策
筚
筛
筜
筝
筠
筥
筮
筳
筵
筷
筹
筼
签
简
箍
箓
箔
箕
算
箝
管
箦
箧
箨
箩
箪
箫
箬
箭
箱
箴
箸
篁
篆
篇
篏
篓
篙
篡
篥
篦
篮
篱
篷
篾
簆
簇
簌
簏
簟
簠
簧
簪
簸
簿
籁
籍
籥
籰
米
籴
类
粉
粒
粗
粘
粝
粟
粤
粥
粪
粮
粱
粲
粳
粹
粼
粽
精
糊
糕
糖
糙
糜
糟
糠
糯
糰
糸
系
紊
紞
素
索
紥
紧
紫
累
絏
絪
絮
絯
綝
綦
縠
縺
縻
繁
繇
繖
纂
纕
纛
纟
纠
纡
红
纣
纤
纥
约
级
纨
纪
纫
纬
纭
纮
纯
纱
纲
纳
纵
纶
纷
纸
纹
纺
纻
纽
线
绁
练
组
绅
细
织
终
绉
绊
绍
绎
经
绑
绒
结
绔
绕
绘
给
绚
绛
络
绝
绞
统
绡
绢
绣
绥
绦
继
绩
绪
绫
续
绮
绰
绲
绳
维
绵
绶
绷
绸
绺
绻
综
绽
绾
绿
缀
缁
缂
缃
缄
缆
缈
缉
缊
缎
缓
缔
缕
编
缘
缙
缚
缝
缟
缠
缢
缣
缤
缥
缧
缨
缩
缪
缭
缮
缯
缰
缱
缴
缵
缸
缺
罄
罍
罐
网
罔
罕
罗
罘
罚
罡
罢
罥
罦
罩
罪
罬
置
署
罳
罴
罹
罽
罾
羁
羊
羌
美
羑
羓
羔
羕
羚
羞
羡
群
羯
羲
羸
羹
羼
羽
羿
翁
翅
翊
翎
翔
翕
翘
翛
翟
翠
翡
翣
翥
翦
翩
翮
翰
翱
翳
翻
翼
耀
老
考
者
耆
而
耍
耎
耐
耑
耒
耕
耗
耘
耙
耧
耨
耳
耶
耸
耻
耽
耿
聂
聆
聊
聋
职
聒
联
聘
聚
聪
肃
肄
肆
肉
肋
肌
肏
肐
肓
肖
肘
肚
肝
肠
股
肢
肤
肥
肩
肮
肯
肱
育
肴
肷
肺
肾
肿
胀
胁
胃
胄
胆
背
胎
胖
胜
胝
胞
胠
胡
胤
胥
胧
胪
胫
胭
胯
胳
胶
胸
能
脂
脆
脉
脊
脍
脏
脐
脑
脓
脖
脚
脩
脯
脱
脸
脾
腆
腊
腋
腌
腐
腑
腔
腕
腥
腭
腮
腰
腴
腹
腻
腼
腾
腿
膀
膂
膈
膊
膏
膑
膘
膛
膜
膝
膨
膭
膳
膺
膻
臀
臁
臂
臆
臊
臜
臣
臧
自
臭
至
致
臻
臼
臾
舀
舂
舄
舅
舆
舌
舍
舐
舒
舔
舛
舜
舞
舟
舡
航
舫
般
舰
舱
舵
舸
船
艇
艎
艘
艟
艨
艮
良
艰
色
艳
艹
艺
艾
节
芊
芋
芍
芎
芒
芙
芜
芝
芟
芤
芥
芦
芪
芫
芬
芭
芰
花
芳
芷
芸
芹
芽
苇
苋
苌
苍
苏
苑
苒
苓
苔
苕
苗
苛
苞
苟
苡
若
苦
苫
英
苴
苹
苾
茁
茂
范
茄
茅
茆
茉
茎
茏
茑
茔
茕
茗
茜
茝
茧
茨
茫
茬
茭
茯
茱
茴
茵
茶
茸
茹
荀
荆
荇
草
荏
荐
荑
荒
荔
荙
荚
荜
荞
荠
荡
荣
荤
荥
荦
荧
荨
荩
荫
荬
药
荳
荷
荻
荼
荽
莅
莉
莎
莒
莓
莘
莙
莞
莠
莩
莫
莱
莲
莳
莴
获
莹
莺
莼
莽
菁
菂
菇
菊
菌
菑
菔
菖
菘
菜
菠
菡
菩
菰
菱
菲
菽
菾
萁
萃
萄
萋
萌
萍
萎
萏
萝
萤
营
萦
萧
萨
萱
萸
萼
落
葆
著
葛
葡
董
葩
葫
葬
葭
葱
葳
葵
葹
葺
蒂
蒋
蒙
蒜
蒭
蒯
蒲
蒳
蒸
蒹
蒺
蒿
蓁
蓄
蓉
蓊
蓍
蓏
蓑
蓝
蓟
蓦
蓬
蓼
蔑
蔓
蔔
蔗
蔚
蔡
蔬
蔷
蔺
蔻
蔼
蔽
蕃
蕈
蕉
蕊
蕖
蕗
蕙
蕤
蕨
蕲
蕴
薄
薅
薇
薋
薏
薛
薜
薤
薨
薪
薯
薰
薷
藁
藉
藏
藐
藓
藕
藜
藤
藩
藻
藿
蘅
蘋
蘑
蘛
蘩
蘸
蘼
虀
虎
虏
虐
虑
虔
虚
虞
虢
虫
虬
虱
虹
虼
虽
虾
虿
蚁
蚂
蚊
蚌
蚓
蚕
蚣
蚤
蚩
蚯
蚱
蛀
蛄
蛆
蛇
蛉
蛊
蛋
蛎
蛏
蛙
蛛
蛟
蛤
蛩
蛭
蛮
蛰
蛱
蛾
蜀
蜂
蜃
蜇
蜈
蜉
蜋
蜍
蜓
蜕
蜗
蜘
蜚
蜜
蜡
蜢
蜮
蜷
蜺
蜻
蜼
蜾
蝇
蝈
蝉
蝌
蝎
蝗
蝙
蝠
蝣
蝥
蝴
蝶
蝼
螂
螃
融
螟
螫
螭
螯
螳
螺
蟀
蟆
蟊
蟋
蟒
蟟
蟠
蟪
蟭
蟮
蟹
蟾
蠃
蠓
蠙
蠡
蠢
蠫
蠲
蠹
血
衄
衅
行
衍
衔
衕
街
衙
衠
衡
衢
衣
衤
补
表
衫
衬
衮
衰
衲
衷
衽
衾
衿
袁
袂
袄
袅
袈
袋
袍
袒
袖
袛
袜
袢
袤
被
袭
袱
袴
袷
裀
裁
裂
装
裆
裒
裔
裕
裘
裙
裟
裢
裤
裨
裩
裰
裱
裳
裴
裸
裹
裾
褂
褃
褊
褐
褒
褓
褕
褚
褛
褡
褥
褪
褫
褭
褴
褵
褶
襁
襄
襕
襜
襟
西
要
覆
覈
见
观
规
觅
视
觇
览
觉
觊
觌
觎
觐
觑
角
觔
觚
觜
觞
解
觥
触
觫
觯
觳
言
訇
訾
詈
詹
誉
誊
誓
謑
譔
警
譬
讙
计
订
讣
认
讥
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讵
讶
许
讹
论
讼
讽
设
访
诀
证
诂
诃
评
识
诈
诉
诊
诋
诌
词
诎
诏
诐
译
诓
诔
试
诗
诘
诙
诚
诛
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
诬
语
诮
误
诰
诱
诲
诳
说
诵
请
诸
诹
诺
读
诼
诽
课
谀
谁
调
谄
谅
谆
谇
谈
谊
谋
谌
谍
谎
谏
谐
谑
谒
谓
谕
谖
谗
谘
谙
谚
谛
谜
谞
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谬
谭
谮
谯
谱
谲
谴
谵
谶
谷
豁
豆
豇
豕
豚
豝
象
豨
豪
豫
豸
豹
豺
貂
貅
貉
貌
貔
賨
贝
贞
负
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贴
贵
贷
贸
费
贺
贻
贼
贽
贾
贿
赀
赁
赂
赃
资
赆
赈
赊
赋
赌
赍
赎
赏
赐
赑
赓
赔
赖
赘
赚
赛
赜
赞
赠
赡
赢
赣
赤
赥
赦
赧
赫
赭
走
赴
赵
赶
起
赾
趁
趄
超
越
趋
趔
趟
趣
趫
趱
足
趷
趸
趺
趾
跃
跄
跋
跌
跎
跏
跐
跑
跖
跘
跛
距
跞
跟
跣
跤
跨
跪
跬
路
跳
跴
践
跶
跷
跸
跹
跺
跼
踅
踉
踊
踌
踏
踘
踞
踟
踡
踢
踧
踩
踪
踮
踱
踵
踹
蹁
蹄
蹅
蹇
蹈
蹉
蹊
蹋
蹍
蹐
蹑
蹙
蹡
蹦
蹬
蹭
蹰
蹱
蹲
蹴
蹶
蹻
蹼
蹾
蹿
躁
躄
躇
躔
躘
躧
身
躬
躯
躲
躺
軃
輀
轘
车
轧
轨
轩
轫
转
轮
软
轰
轲
轳
轴
轵
轸
轻
轼
载
轿
辂
较
辄
辅
辆
辇
辈
辉
辋
辍
辎
辏
辐
辑
输
辔
辕
辖
辗
辘
辙
辚
辛
辜
辞
辟
辣
辨
辩
辫
辰
辱
边
辽
达
辿
迁
迂
迄
迅
过
迈
迍
迎
运
近
迓
返
还
这
进
远
违
连
迟
迢
迤
迥
迦
迨
迩
迪
迫
迭
述
迳
迷
迸
迹
追
退
送
适
逃
逅
逆
选
逊
逍
透
逐
递
途
逗
通
逛
逝
逞
速
造
逡
逢
逦
逭
逮
逵
逶
逸
逻
逼
逾
遁
遂
遇
遍
遏
遐
遑
道
遗
遣
遥
遨
遭
遮
遵
遽
避
邀
邂
邃
邅
邈
邑
邓
邕
邙
邛
邢
那
邦
邪
邬
邮
邯
邰
邱
邳
邴
邵
邷
邸
邹
邺
邻
邽
邾
郁
郃
郊
郎
郏
郑
郗
郜
郝
郡
郢
郤
郦
部
郭
郯
郸
都
郾
郿
鄂
鄄
鄙
鄠
鄢
鄣
鄱
鄹
酂
酆
酉
酊
酋
酌
配
酎
酒
酕
酗
酝
酡
酣
酤
酥
酩
酪
酬
酱
酲
酴
酷
酸
酹
酽
酾
酿
醁
醄
醅
醉
醋
醍
醐
醑
醒
醢
醪
醮
醴
醺
醿
采
释
里
重
野
量
金
釜
釭
釿
鈇
鈚
鉏
鉴
銮
鋘
錾
鍪
鎏
鏖
鐄
鐏
鑨
钁
针
钉
钏
钓
钗
钝
钞
钟
钢
钤
钥
钦
钧
钩
钮
钯
钱
钳
钵
钹
钺
钻
钿
铁
铃
铄
铅
铇
铊
铎
铙
铛
铜
铞
铠
铢
铣
铨
铩
铫
铭
铮
铰
铲
铳
银
铸
铺
链
铿
销
锁
锄
锅
锈
锉
锋
锐
错
锚
锞
锟
锡
锢
锣
锤
锥
锦
锨
锭
键
锯
锱
锲
锵
锹
锺
锻
镀
镂
镇
镌
镔
镕
镛
镜
镝
镟
镢
镫
镬
镯
镰
镴
镵
镶
长
閤
闇
门
闩
闪
闭
问
闯
闰
闱
闲
间
闵
闷
闸
闹
闺
闻
闼
闽
闾
闿
阁
阃
阄
阅
阆
阇
阉
阊
阍
阎
阏
阐
阑
阒
阔
阕
阖
阗
阙
阚
阜
阝
队
阡
阪
阮
阱
防
阳
阴
阵
阶
阻
阿
陀
陂
附
际
陆
陇
陈
陋
陌
降
限
陕
陛
陟
陡
院
除
陨
险
陪
陲
陵
陶
陷
隄
隅
隆
隈
隋
隍
随
隐
隔
隗
隘
隙
障
隤
隧
隰
隳
隶
隹
隽
难
雀
雁
雄
雅
集
雇
雉
雌
雍
雏
雒
雕
雝
雠
雨
雪
雯
雳
零
雷
雹
雾
需
霁
霄
霆
震
霉
霍
霎
霏
霓
霖
霜
霞
霭
霰
露
霸
霹
霾
青
靓
靖
静
靛
非
靠
靡
面
靥
靦
革
靬
靳
靴
靶
靸
靼
靿
鞄
鞅
鞋
鞍
鞑
鞒
鞓
鞘
鞠
鞦
鞫
鞭
韂
韦
韧
韩
韪
韫
韬
韭
音
韵
韶
頫
顑
顒
顗
页
顶
顷
顸
项
顺
须
顽
顾
顿
颀
颁
颂
预
颅
领
颇
颈
颉
颊
颌
颍
颏
颐
频
颓
颔
颖
颗
题
颜
额
颟
颠
颡
颢
颤
颦
颧
风
飏
飐
飒
飕
飖
飘
飙
飞
食
飧
飨
飺
餂
餍
餐
餪
餬
餮
饕
饥
饧
饫
饬
饭
饮
饯
饰
饱
饲
饳
饵
饶
饷
饺
饼
饽
饿
馀
馁
馅
馆
馈
馉
馊
馋
馍
馐
馑
馒
馔
馕
首
馗
馘
香
馥
馨
駃
駔
駬
駼
騂
騄
騊
騔
騕
騠
马
驭
驮
驯
驰
驱
驳
驴
驷
驸
驹
驻
驼
驽
驾
驿
骁
骂
骄
骅
骆
骇
骈
骊
骋
验
骏
骐
骑
骓
骕
骖
骗
骘
骚
骛
骝
骞
骠
骡
骢
骤
骥
骦
骧
骨
骰
骷
骸
髀
髅
髓
高
髟
髡
髦
髫
髭
髯
髻
髽
鬃
鬅
鬏
鬒
鬓
鬘
鬟
鬣
鬯
鬻
鬼
魀
魁
魂
魄
魅
魇
魈
魉
魍
魏
魑
魔
鮆
鮹
鯗
鯾
鱑
鱨
鱼
鲁
鲂
鲅
鲆
鲇
鲈
鲊
鲌
鲍
鲔
鲙
鲛
鲜
鲟
鲤
鲥
鲧
鲨
鲫
鲭
鲮
鲲
鲳
鲵
鲸
鲻
鳅
鳇
鳌
鳏
鳖
鳜
鳝
鳞
鳠
鳷
鴏
鶒
鷃
鷫
鸂
鸟
鸠
鸡
鸣
鸥
鸦
鸨
鸩
鸪
鸬
鸭
鸯
鸰
鸳
鸶
鸷
鸹
鸽
鸾
鸿
鹁
鹂
鹃
鹄
鹅
鹉
鹊
鹌
鹏
鹐
鹑
鹗
鹘
鹚
鹜
鹞
鹡
鹤
鹥
鹦
鹧
鹩
鹪
鹫
鹭
鹰
鹳
鹴
鹾
鹿
麀
麂
麈
麋
麒
麓
麖
麝
麟
麦
麴
麻
麾
黄
黉
黍
黎
黑
黔
默
黛
黜
黠
黥
黧
黩
黪
黯
黹
黻
黼
黾
鼋
鼍
鼎
鼐
鼒
鼓
鼕
鼙
鼠
鼯
鼻
鼾
齁
齆
齐
齑
齿
龁
龄
龈
龙
龚
龛
龟
！
（
）
＋
，
－
．
：
；
？
［
］
￥
